<?php
    /*
    ******************************************************************************
    ログイン関数
    2021/01/25　服部
    ******************************************************************************
    */

    include __DIR__ . '/sqlsetting.php';

    function login($email, $pass){
        // ログイン成功・失敗を判断する関数(二重定義エラー発生中)
        if (userSarch($email, $pass)){
            echo "ログイン成功";
        } else {
            echo "ログイン失敗";
        }
    }

    login($_POST['email'], $_POST['password']);